<a href="https://colab.research.google.com/github/Taweechokk/INC492/blob/main/Pandas_Exercise_(1).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **INC492: Introduction to Data Science**

Week02 - Python for Data Science
-----------------------------------
Dr. Teema Leangarun

Department of Controls System and Instrumentation Engineering

Facullty of Engineering, KMUTT

Student name: xxxxxxxxx

Student ID: xxxxxxxxxx

#Pandas Exercise

##Exercise 1
Write a Pandas program to add, subtract, multiple, divide and compare two Pandas Series.<br>
Given Series:
```
series_1 = [92, 82, 44, 79, 58, 0]
series_2 = [22, 31, 36, 71, 58, 15]
```

In [ ]:
#import pandas library and name it to be pd
import pandas as pd

In [ ]:
#create series
series_1 = [92, 82, 44, 79, 58, 0]
series_1 = pd.Series(data = series_1)
print(series_1)

0    92
1    82
2    44
3    79
4    58
5     0
dtype: int64

In [ ]:
series_2 = [22, 31, 36, 71, 58, 15]
series_2 = pd.Series(data = series_2)
print(series_2)

0    22
1    31
2    36
3    71
4    58
5    15
dtype: int64

###Q 1.1
add, subtract, multiply and divide to the element of the two series

In [ ]:
#add
add = series_1+series_2
#display add result
add

0    114
1    113
2     80
3    150
4    116
5     15
dtype: int64

In [ ]:
#subtract
subtract = series_1-series_2
#display subtract result
subtract

0    70
1    51
2     8
3     8
4     0
5   -15
dtype: int64

In [ ]:
#multiply
multiply = series_1*series_2
#display multiply result
multiply

0    2024
1    2542
2    1584
3    5609
4    3364
5       0
dtype: int64

In [ ]:
#divide
divide = series_1/series_2
#display diveide result
divide

0    4.181818
1    2.645161
2    1.222222
3    1.112676
4    1.000000
5    0.000000
dtype: float64

In [ ]:
#compare
print("Series1:")
print(series_1)
print("Series2:")
print(series_2)

Series1:
0    92
1    82
2    44
3    79
4    58
5     0
dtype: int64
Series2:
0    22
1    31
2    36
3    71
4    58
5    15
dtype: int64

###Q 1.2
Compare the elements of the said Series:

In [ ]:
#Equal
Equal = series_1==series_2
print("Equal:")
print(Equal)

Equal:
0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [ ]:
#Greater than
Greater_than = series_1>series_2
print("Greater_than:")
print(Greater_than)

Greater_than:
0     True
1     True
2     True
3     True
4    False
5    False
dtype: bool

In [ ]:
#Less than
Less_than = series_1<series_2
print("Greater_than:")
print(Greater_than)

Greater_than:
0     True
1     True
2     True
3     True
4    False
5    False
dtype: bool

##Exercise 2

In [ ]:
#import pandas and numpy libraries and name it to be pd and np, respectively.
import pandas as pd
import numpy as np

###Q 2.1
Write a Pandas program to convert a dictionary to a Pandas series.<br>
Given dictionary:
```
d1 = {'a': 500, 'b': 300, 'c': 100, 'd': 900, 'e': 600}
```

In [ ]:
#create dictionary
d1 = {'a': 500, 'b': 300, 'c': 100, 'd': 900, 'e': 600}

#display original array
print("Original dictionary:")
print(d1)

Original dictionary:
{'a': 500, 'b': 300, 'c': 100, 'd': 900, 'e': 600}

In [ ]:
#covert dictionary to pandas series
d1=pd.Series(d1)

#display result
print("Converted series:")
print(d1)

Converted series:
a    500
b    300
c    100
d    900
e    600
dtype: int64

###Q 2.2
Write a Pandas program to convert a NumPy array to a Pandas series.<br>
Sample NumPy array:
```
a1 = [20, 10, 90, 60, 50]
```

In [ ]:
#create numpy array
a1 = [20, 10, 90, 60, 50]
arr1 = np.array(a1)

#display original array
print("NumPy array:")
print(arr1)

NumPy array:
[20 10 90 60 50]

In [ ]:
#covert numpy array to pandas series
Series = pd.Series(arr1)

#display result
print("Converted Pandas series:")
print(Series)

Converted Pandas series:
0    20
1    10
2    90
3    60
4    50
dtype: int64

##Exercise 3
Given Python dictionary data and list labels:
```
exam_data = {
'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, nan, 9, 20, 14.5, nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

```

In [ ]:
#import pandas and numpy libraries and name it to be pd and np, respectively.
import pandas as pd
import numpy as np

In [ ]:
#create dataframe
exam_data = {
'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#display original dataframe
df = pd.DataFrame(exam_data,index=labels)
print("Orginal rows:")
print(df)

Orginal rows:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

###Q 3.1
Display a summary of the basic information about a specified DataFrame and its data.

In [ ]:
#display basic infomation of dataframe
print("Summary of the basic information about this DataFrame and its data:")
print(df.info())

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

###Q 3.2
Get the first 3 rows of DataFrame.

In [ ]:
#display first 3 row of dataframe
print("First three rows of the data frame:")
print(df.head(3))

First three rows of the data frame:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

###Q 3.3
Select the 'name' and 'score' columns from the following DataFrame.

In [ ]:
#display the selection
print("Select specific columns:")
print(df[['name','score']])

Select specific columns:
        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

###Q 3.4
Select the rows the score is between 15 and 20 (inclusive).

In [ ]:
#display selection
print("Rows where score between 15 and 20 (inclusive):")
print(df[(df['score'] >= 15) & (df['score'] <= 20)])

Rows where score between 15 and 20 (inclusive):
        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

###Q3.5
Append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.<br>

Values for each column will be:
```
name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
```

In [ ]:
#add new row 'k'
value_k = {'name': ['Suresh'], 'score': [15.5], 'attempts': [1], 'qualify': ['yes']}
new_row = pd.DataFrame(value_k,index=['k'])
df = df.append(new_row)
#display result after add row
print("Append a new row:")
print(df)

Append a new row:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     Suresh   15.5         1     yes

<ipython-input-95-8f0a776309df>:4: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_row)

In [ ]:
#drop row 'k'
df = df.drop('k')

#display result after drop row
print("Delete the new row and display the original  rows:")
print(df)

Delete the new row and display the original  rows:
        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

###Q 3.6
Sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [ ]:
#sorting
df_sort= df.sort_values(by=['name', 'score'],ascending=[False, True] )

#display result
print("Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:")
print(df_sort)

Sort the data frame first by ‘name’ in descending order, then by ‘score’ in ascending order:
        name  score  attempts qualify
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
c  Katherine   16.5         2     yes
j      Jonas   19.0         1     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
b       Dima    9.0         3      no
a  Anastasia   12.5         1     yes

###Q 3.7
Replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [ ]:
#replace yes/no with true/false
df['qualify'] = df['qualify'].replace({'yes': True, 'no': False})

#display result
print("Replace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:")
print(df)

Replace the 'qualify' column contains the values 'yes' and 'no'  with True and  False:
        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d      James    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

###Q 3.8
Change the name 'James' to 'Suresh' in name column of the DataFrame

In [ ]:
#change value in dataframe
df['name'] = df['name'].replace('James', 'Suresh')

#display result
print("Change the name 'James' to ‘Suresh’:")
print(df)

Change the name 'James' to ‘Suresh’:
        name  score  attempts  qualify
a  Anastasia   12.5         1     True
b       Dima    9.0         3    False
c  Katherine   16.5         2     True
d     Suresh    NaN         3    False
e      Emily    9.0         2    False
f    Michael   20.0         3     True
g    Matthew   14.5         1     True
h      Laura    NaN         1    False
i      Kevin    8.0         2    False
j      Jonas   19.0         1     True

###Q 3.9
Delete the 'attempts' column from the DataFrame.

In [ ]:
#delete column
df = df.drop('attempts', axis=1)

#display result
print("Delete the 'attempts' column from the data frame:")
print(df)

Delete the 'attempts' column from the data frame:
        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d     Suresh    NaN    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

###Q 3.10
Insert a new column in existing DataFrame.

In [ ]:
#insert new column
df['color'] = ['Red', 'Blue', 'Orange', 'Red', 'White', 'White', 'Blue', 'Green', 'Green', 'Red']

#display result
print("New DataFrame after inserting the 'color' column")
print(df)

New DataFrame after inserting the 'color' column
        name  score  qualify   color
a  Anastasia   12.5     True     Red
b       Dima    9.0    False    Blue
c  Katherine   16.5     True  Orange
d     Suresh    NaN    False     Red
e      Emily    9.0    False   White
f    Michael   20.0     True   White
g    Matthew   14.5     True    Blue
h      Laura    NaN    False   Green
i      Kevin    8.0    False   Green
j      Jonas   19.0     True     Red

##Exercise 4
Test Data:<br>
<table style="width:100%">
  <tr>
    <th>Dataframe index</th>
    <th>school_code</th>
    <th>class</th>
    <th>name</th>
    <th>date_Of_Birth</th>
    <th>weight</th>
    <th>address</th>
    <th>t_id</th>
  </tr>
  <tr>
    <td>0                </td>
    <td>s001             </td>
    <td>V                </td>
    <td>Alberto Franco   </td>
    <td>15/05/2002       </td>
    <td>35               </td>
    <td>street1          </td>
    <td>t1               </td>
  </tr>
  <tr>
    <td>1                </td>        
    <td>s002             </td>     
    <td>V                </td>    
    <td>Gino Mcneill     </td>     
    <td>17/05/2002       </td>      
    <td>32               </td>  
    <td>street2          </td>   
    <td>t2               </td>
  </tr>
  <tr>
    <td>2                </td>
    <td>s003             </td>
    <td>VI               </td>
    <td>Ryan Parkes      </td>
    <td>16/02/1999       </td>
    <td>33               </td>
    <td>street3          </td>
    <td>t3               </td>
</tr>
<tr>
    <td>3                </td>
    <td>s001             </td>
    <td>VI               </td>
    <td>Eesha Hinton     </td>
    <td>25/09/1998       </td>
    <td>30               </td>
    <td>street1          </td>
    <td>t4               </td>
</tr>
<tr>
    <td>4                 </td>
    <td>s002              </td>
    <td>V                 </td>
    <td>Gino Mcneill      </td>
    <td>11/05/2002        </td>
    <td>31                </td>
    <td>street2           </td>
    <td>t5                </td>
</tr>
<tr>
    <td>5                 </td>
    <td>s004              </td>
    <td>VI                </td>
    <td>David Parkes      </td>
    <td>15/09/1997        </td>
    <td>32                </td>
    <td>street4           </td>
    <td>t6                </td>
</tr>

</table>

Create datafram from test data

In [ ]:
#import pandas libraries and name it to be pd.
import pandas as pd

In [ ]:
#create dataframe
data = {
    'school_code': ['s001', 's002', 's003', 's001', 's002', 's004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002', '17/05/2002', '16/02/1999', '25/09/1998', '11/05/2002', '15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']
}

df = pd.DataFrame(data)

#display original dataframe
print("Original DataFrame:")
print(df)

Original DataFrame:
  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

###Q 4.1
display the default index and set a column as an Index.

In [ ]:
#check head
print("Default Index:")
print(df)

Default Index:
  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [ ]:
#set index of 'df' to be "school_code" and assign it in variable name: 'df1'
df1 = df.set_index('school_code')
print("school_code as new Index:")
print(df1)

school_code as new Index:
            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

In [ ]:
#set index of 'df' to be "t_id" and assign it in variable name: 'df2'
df2 = df.set_index('t_id')
print("t_id as new Index:")
print(df2)

t_id as new Index:
     school_code class            name date_Of_Birth  weight  address
t_id
t1          s001     V  Alberto Franco    15/05/2002      35  street1
t2          s002     V    Gino Mcneill    17/05/2002      32  street2
t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
t5          s002     V    Gino Mcneill    11/05/2002      31  street2
t6          s004    VI    David Parkes    15/09/1997      32  street4

###Q 4.2
create a multi Index frame using two columns and using an Index and a column.

In [ ]:
#set multiple index of 'df' to be "t_id", "class" and "school_code", respectively. And assign it in variable name: 'df3'
df3 = df.set_index(['t_id', 'class', 'school_code'])
print("t_id as new Index:")
print(df3)

t_id as new Index:
                                  name date_Of_Birth  weight  address
t_id class school_code
t1   V     s001         Alberto Franco    15/05/2002      35  street1
t2   V     s002           Gino Mcneill    17/05/2002      32  street2
t3   VI    s003            Ryan Parkes    16/02/1999      33  street3
t4   VI    s001           Eesha Hinton    25/09/1998      30  street1
t5   V     s002           Gino Mcneill    11/05/2002      31  street2
t6   VI    s004           David Parkes    15/09/1997      32  street4

In [ ]:
#set multiple index of 'df' to be "index" and "t_id", and assign it in variable name: 'df4'
df4 = df.set_index('t_id')
df4 = df4.reset_index()
print("MultiIndex using an Index and a column:")
print(df4)

MultiIndex using an Index and a column:
  t_id school_code class            name date_Of_Birth  weight  address
0   t1        s001     V  Alberto Franco    15/05/2002      35  street1
1   t2        s002     V    Gino Mcneill    17/05/2002      32  street2
2   t3        s003    VI     Ryan Parkes    16/02/1999      33  street3
3   t4        s001    VI    Eesha Hinton    25/09/1998      30  street1
4   t5        s002     V    Gino Mcneill    11/05/2002      31  street2
5   t6        s004    VI    David Parkes    15/09/1997      32  street4

### Q 4.3
set value in a specific cell in df4 using index.

In [ ]:
#set value of school_code from s004 to s005
index_to_update = df4[df4['school_code'] == 's004'].index[0];

# Set the value at the specified index and column
df4.at[index_to_update, 'school_code'] = 's005';

#display result
print("Set school code 's004' to 's005':")
print(df4.iloc[5,1])

Set school code 's004' to 's005':
s005

In [ ]:
index_to_update = df4[df4['name'] == 'Alberto Franco'].index[0]
df4.at[index_to_update, 'date_Of_Birth'] = '16/05/2002'

# Create a new DataFrame 'display' with the required columns
display = df4[['school_code', 'class', 'name', 'date_Of_Birth', 'weight', 'address', 't_id', 'date_Of_Birth']].copy()

# Rename the 'date_Of_Birth' column to 'date_of_birth'
display.rename(columns={'date_Of_Birth': 'date_of_birth'})

# Print the 'display' DataFrame
print(display)

  school_code class            name date_Of_Birth  weight  address t_id  \
0        s001     V  Alberto Franco    16/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s005    VI    David Parkes    15/09/1997      32  street4   t6

  date_Of_Birth
0    16/05/2002
1    17/05/2002
2    16/02/1999
3    25/09/1998
4    11/05/2002
5    15/09/1997

###Q 4.4
reset the index of df1 and convert 1st and 3rd levels in the index into columns from a multiple level of index frame of df3.

In [ ]:
#reset the index of df1 and assign it into df5
df6 = df1.reset_index()
print("Reset the index:")
print(df6)

Reset the index:
  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [ ]:
#convert the index of df3 and assign it into df6
df6 = df3.reset_index(level=[0, 2])

# Displaying the modified DataFrame (df2)
print("Convert 1st and 3rd levels in the index frame into columns:")
print(df6)

Convert 1st and 3rd levels in the index frame into columns:
      t_id school_code            name date_Of_Birth  weight  address
class
V       t1        s001  Alberto Franco    15/05/2002      35  street1
V       t2        s002    Gino Mcneill    17/05/2002      32  street2
VI      t3        s003     Ryan Parkes    16/02/1999      33  street3
VI      t4        s001    Eesha Hinton    25/09/1998      30  street1
V       t5        s002    Gino Mcneill    11/05/2002      31  street2
VI      t6        s004    David Parkes    15/09/1997      32  street4

##Exercise 5

Combine two DataFrame objects by filling null values in one DataFrame with non-null values from other DataFrame.

Given dataframe
```
df5_1 = pd.DataFrame({'A': [None, 2, None], 'B': [4, 5, 6]})
df5_2 = pd.DataFrame({'A': [1, 1, 3], 'B': [9, None, 5]})
```

In [ ]:
#import pandas libraries and name it to be pd.
import pandas as pd

In [ ]:
#create dataframe
df5_1 = pd.DataFrame({'A': [None, 2, None], 'B': [4, 5, 6]})
df5_2 = pd.DataFrame({'A': [1, 1, 3], 'B': [9, None, 5]})

#diplay original dataframe
print("Original DataFrames:")
print(df5_1)

print("--------------------")
print(df5_2)

Original DataFrames:
     A  B
0  NaN  4
1  2.0  5
2  NaN  6
--------------------
   A    B
0  1  9.0
1  1  NaN
2  3  5.0

In [ ]:
#merge two dataframe
merged_df = pd.merge(df5_1, df5_2, on='A', how='inner', suffixes=('_df5_1', '_df5_2'))

# Selecting relevant columns for display
display_df = merged_df[['A', 'B_df5_1']]

#display result
print("Merged DataFrame:")
print(merged_df)

Merged DataFrame:
Empty DataFrame
Columns: [A, B_df5_1, B_df5_2]
Index: []

##Exercise 6
Data 1: <br>
<table style="width:100%">
    <tr>
        <th>Dataframe index</th>
        <th>student_id</th>
        <th>name</th>
        <th>marks</th>
    </tr>
    <tr>
        <td>0               </td>
        <td>S1              </td>
        <td>Danniella Fenton</td>
        <td>200</td>
    </tr>
    <tr>
        <td>1               </td>
        <td>S2              </td>
        <td>Ryder Storey    </td>
        <td>210             </td>
    </tr>
    <tr>
        <td>2               </td>
        <td>S3              </td>
        <td>Bryce Jensen    </td>
        <td>190             </td>
    </tr>
    <tr>
        <td>3               </td>
        <td>S4              </td>
        <td>Ed Bernal       </td>
        <td>222             </td>
    </tr>
    <tr>
        <td>4               </td>
        <td>S5              </td>
        <td>Kwame Morin     </td>
        <td>199             </td>
    </tr>
</table>
<br>
Data 2: <br>
<table style="width:100%">
    <tr>
        <th>Dataframe index</th>
        <th>student_id</th>
        <th>name</th>
        <th>marks</th>
    </tr>
    <tr>
        <td>0               </td>
        <td>S4              </td>
        <td>Scarlette Fisher</td>
        <td>201</td>
    </tr>
    <tr>
        <td>1               </td>
        <td>S5              </td>
        <td>Carla Williamson</td>
        <td>200             </td>
    </tr>
    <tr>
        <td>2               </td>
        <td>S6              </td>
        <td>Dante Morse     </td>
        <td>198             </td>
    </tr>
    <tr>
        <td>3               </td>
        <td>S7              </td>
        <td>Kaiser William  </td>
        <td>219             </td>
    </tr>
    <tr>
        <td>4               </td>
        <td>S8              </td>
        <td>Madeeha Preston </td>
        <td>201             </td>
    </tr>
</table>

In [ ]:
#import pandas libraries and name it to be pd.
import pandas as pd

In [ ]:
#create dataframe
data = {'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
        'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'],
        'marks': [200, 210, 190, 222, 199]}
data2 = {'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
         'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'],
         'marks': [201, 200, 198, 219, 201]}

df = pd.DataFrame(data)
df2 = pd.DataFrame(data2)

#display original dataframe
print("Original DataFrames:")
print(df)
print("-------------------------------------")
print(df2)

Original DataFrames:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
-------------------------------------
  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

###Q 6.1
join the two given dataframes along **rows** and assign all data.

In [ ]:
#join two dataframe by row
result_df = pd.concat([df, df2])

#display result
print("Join the said two dataframes along rows:")
print(result_df)

Join the said two dataframes along rows:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

###Q 6.2
join the two given dataframes along **columns** and assign all data.

In [ ]:
#join two dataframe by column
result_df = pd.concat([df, df2], axis=1)

#display result
print("Join the said two dataframes along columns:")
print(result_df)

Join the said two dataframes along columns:
  student_id              name  marks student_id              name  marks
0         S1  Danniella Fenton    200         S4  Scarlette Fisher    201
1         S2      Ryder Storey    210         S5  Carla Williamson    200
2         S3      Bryce Jensen    190         S6       Dante Morse    198
3         S4         Ed Bernal    222         S7    Kaiser William    219
4         S5       Kwame Morin    199         S8   Madeeha Preston    201

###Q 6.3
append a list of dictioneries to a existing DataFrame and display the combined data.

```
Dictionary:
student_id                  S6
name          Scarlette Fisher
marks                      203

student_id                  S7
name          Scarlette Fisher
marks                      207
```

In [ ]:
#create dictionary
new_data = [{'student_id': 'S6', 'name': 'Scarlette Fisher', 'marks': 203},
            {'student_id': 'S7', 'name': 'Bryce Jensen', 'marks': 207}]

#display dictionary
new_data

[{'student_id': 'S6', 'name': 'Scarlette Fisher', 'marks': 203},
 {'student_id': 'S7', 'name': 'Bryce Jensen', 'marks': 207}]

In [ ]:
#append dicts with dataframe
combined_df = pd.concat([df, pd.DataFrame(new_data)], ignore_index=True)

#display result
print("Combined Data:")
print(combined_df)

Combined Data:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S6  Scarlette Fisher    203
6         S7      Bryce Jensen    207

###Q 6.4
join the two given dataframes along rows and merge with another dataframe along the common column id

```
exam_data:
   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12
```

In [ ]:
#create dataframe
exam_data = {'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
             'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]}
df_exam = pd.DataFrame(exam_data)

In [ ]:
#concatenate two dataframe
result_df = pd.concat([df, df2])

#display result
print("Join the said two dataframes along rows:")
print(result_df)

Join the said two dataframes along rows:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [ ]:
#merge dataframe
result_df_merge = pd.merge(result_df,df_exam,on="student_id")

#display result
print("Now join the said result_data and df_exam_data along student_id:")
print(result_df_merge)

Now join the said result_data and df_exam_data along student_id:
  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

###Q 6.5
join the two dataframes using the common column of both dataframes.

In [ ]:
#merge dataframe
merged_data = pd.merge(df, df2, on='student_id', how='inner')


#display result
print("Merged data (inner join):")
print(merged_data)

Merged data (inner join):
  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

##Exercise 7

In [ ]:
#import pandas libraries and name it to be pd.
import pandas as pd

In [ ]:
#import csv
from google.colab import files

# Upload the CSV file using the file picker dialog
uploaded = files.upload()

# Get the file name from the uploaded files
file_name = list(uploaded.keys())[0]

# Read the CSV file into a DataFrame
df = pd.read_csv(file_name)
df

Saving Alcohol_Dataset.csv to Alcohol_Dataset.csv

,Year,WHO region,Country,Beverage Types,Display Value
0,1986,Western Pacific,Viet Nam,Wine,0.00
1,1986,Americas,Uruguay,Other,0.50
2,1985,Africa,Cte d'Ivoire,Wine,1.62
3,1986,Americas,Colombia,Beer,4.27
4,1987,Americas,Saint Kitts and Nevis,Beer,1.98
...,...,...,...,...,...
95,1984,Africa,Niger,Other,0.00
96,1985,Europe,Luxembourg,Wine,7.38
97,1984,South-East Asia,Indonesia,Wine,0.00
98,1984,Africa,Equatorial Guinea,Wine,0.00
99,1985,South-East Asia,Democratic People's Republic of Korea,Wine,0.00

###Q 7.1
display the dimensions or shape of Alcohol_Dataset. Also extract the column names from the dataset.

In [ ]:
#check head
df_head = df.head()
print('head:')
print(df_head)

#check shape
df_shape = df.shape
print("Shape of the dataframe:",df_shape)

#check column name
df_columns = df.columns
print("columns:")
print(df_columns)

head:
   Year       WHO region                Country Beverage Types  Display Value
0  1986  Western Pacific               Viet Nam           Wine           0.00
1  1986         Americas                Uruguay          Other           0.50
2  1985           Africa           Cte d'Ivoire           Wine           1.62
3  1986         Americas               Colombia           Beer           4.27
4  1987         Americas  Saint Kitts and Nevis           Beer           1.98
Shape of the dataframe: (100, 5)
columns:
Index(['Year', 'WHO region', 'Country', 'Beverage Types', 'Display Value'], dtype='object')

###Q 7.2
find and drop the missing values from Alcohol_Dataset.

In [ ]:
#find missing value
missing_values = df.isnull()
print(missing_values)

     Year  WHO region  Country  Beverage Types  Display Value
0   False       False    False           False          False
1   False       False    False           False          False
2   False       False    False           False          False
3   False       False    False           False          False
4   False       False    False           False          False
..    ...         ...      ...             ...            ...
95  False       False    False           False          False
96  False       False    False           False          False
97  False       False    False           False          False
98  False       False    False           False          False
99  False       False    False           False          False

[100 rows x 5 columns]

In [ ]:
#drop nan value
df_without_nan = df.dropna()
print(df_without_nan)

    Year       WHO region                                Country  \
0   1986  Western Pacific                               Viet Nam
1   1986         Americas                                Uruguay
2   1985           Africa                           Cte d'Ivoire
3   1986         Americas                               Colombia
4   1987         Americas                  Saint Kitts and Nevis
..   ...              ...                                    ...
95  1984           Africa                                  Niger
96  1985           Europe                             Luxembourg
97  1984  South-East Asia                              Indonesia
98  1984           Africa                      Equatorial Guinea
99  1985  South-East Asia  Democratic People's Republic of Korea

   Beverage Types  Display Value
0            Wine           0.00
1           Other           0.50
2            Wine           1.62
3            Beer           4.27
4            Beer           1.98
..            ...            ...
95          Other           0.00
96           Wine           7.38
97           Wine           0.00
98           Wine           0.00
99           Wine           0.00

[95 rows x 5 columns]

###Q 7.3
remove the duplicates from 'WHO region' column of Alcohol_Dataset.

In [ ]:
#drop duplicates
Alcohol_Dataset_no_duplicates = df.drop_duplicates(subset='WHO region')
print(Alcohol_Dataset_no_duplicates)

    Year             WHO region       Country Beverage Types  Display Value
0   1986        Western Pacific      Viet Nam           Wine           0.00
1   1986               Americas       Uruguay          Other           0.50
2   1985                 Africa  Cte d'Ivoire           Wine           1.62
13  1984  Eastern Mediterranean   Afghanistan          Other           0.00
18  1984                 Europe        Norway        Spirits           1.62
20  1986        South-East Asia       Myanmar           Wine           0.00

###Q 7.4
find out the 'WHO region, 'Country', 'Beverage Types' in the year '1986' or '1989' where WHO region is 'Americas' or 'Europe' from Alcohol_Dataset.

In [ ]:
#find data
#filtered_df = df[(df['WHO region'].isin(['Americas', 'Europe'])) &
 #(df['Year'].isin([1986,1989])) ]
filtered_df = df[(df['WHO region'].isin(['Americas', 'Europe'])) &
 ((df['Year'] == 1986) | (df['Year'] == 1989))]
print("The world alcohol consumption details in the year ‘1986’ or ‘1989’ where  WHO region is ‘Americas’  or 'Europe':")
print(filtered_df)

The world alcohol consumption details in the year ‘1986’ or ‘1989’ where  WHO region is ‘Americas’  or 'Europe':
    Year WHO region                           Country Beverage Types  \
1   1986   Americas                           Uruguay          Other
3   1986   Americas                          Colombia           Beer
8   1986   Americas               Antigua and Barbuda        Spirits
11  1989   Americas                         Guatemala           Beer
21  1989   Americas                        Costa Rica        Spirits
29  1986     Europe                             Italy          Other
34  1986     Europe                Russian Federation           Wine
37  1986     Europe                            Sweden           Beer
41  1986     Europe                    Czech Republic           Beer
47  1986   Americas                            Mexico          Other
49  1986     Europe                             Malta           Wine
55  1989   Americas                          Suriname           Wine
57  1989     Europe                           Croatia           Wine
64  1989   Americas  Bolivia (Plurinational State of)           Beer
74  1986   Americas  Bolivia (Plurinational State of)        Spirits
78  1989   Americas                           Jamaica          Other
79  1989     Europe                           Finland          Other
83  1986     Europe                           Ukraine          Other
86  1986   Americas                           Bahamas           Wine
91  1989     Europe                          Bulgaria           Beer

    Display Value
1            0.50
3            4.27
8            1.55
11           0.62
21           4.51
29            NaN
34           0.80
37           3.04
41           6.82
47           0.04
49           1.49
55           0.04
57           5.10
64           1.26
74           2.06
78           0.00
79           2.09
83            NaN
86           1.83
91           4.43

###Q 7.5
filter those records which **not appears** in a given list from Alcohol_Dataset.<br>

Given list:<br>
"Africa", "Eastern Mediterranean", "Europe"

In [ ]:
#filter data
regions_to_exclude = ["Africa", "Eastern Mediterranean", "Europe"]
filtered_df = df[~df['WHO region'].isin(regions_to_exclude)]
print(filtered_df)

    Year       WHO region                                Country  \
0   1986  Western Pacific                               Viet Nam
1   1986         Americas                                Uruguay
3   1986         Americas                               Colombia
4   1987         Americas                  Saint Kitts and Nevis
5   1987         Americas                              Guatemala
8   1986         Americas                    Antigua and Barbuda
11  1989         Americas                              Guatemala
12  1985  Western Pacific       Lao People's Democratic Republic
14  1985  Western Pacific                               Viet Nam
16  1984         Americas                             Costa Rica
20  1986  South-East Asia                                Myanmar
21  1989         Americas                             Costa Rica
28  1987  Western Pacific                               Viet Nam
31  1986  Western Pacific       Micronesia (Federated States of)
35  1985         Americas                  Saint Kitts and Nevis
43  1984  Western Pacific                                  China
46  1987         Americas                    Trinidad and Tobago
47  1986         Americas                                 Mexico
48  1987         Americas                              Nicaragua
54  1984         Americas                            El Salvador
55  1989         Americas                               Suriname
56  1987  Western Pacific                               Viet Nam
61  1984  Western Pacific                       Papua New Guinea
62  1987         Americas                               Suriname
64  1989         Americas       Bolivia (Plurinational State of)
74  1986         Americas       Bolivia (Plurinational State of)
78  1989         Americas                                Jamaica
84  1986  South-East Asia                              Sri Lanka
86  1986         Americas                                Bahamas
97  1984  South-East Asia                              Indonesia
99  1985  South-East Asia  Democratic People's Republic of Korea

   Beverage Types  Display Value
0            Wine           0.00
1           Other           0.50
3            Beer           4.27
4            Beer           1.98
5           Other           0.00
8         Spirits           1.55
11           Beer           0.62
12           Beer           0.00
14        Spirits           0.05
16           Wine           0.06
20           Wine           0.00
21        Spirits           4.51
28           Beer           0.11
31           Wine           0.00
35        Spirits           2.24
43           Wine           0.03
46        Spirits           2.26
47          Other           0.04
48           Beer           0.70
54        Spirits           1.81
55           Wine           0.04
56           Wine           0.00
61        Spirits           0.08
62          Other           0.00
64           Beer           1.26
74        Spirits           2.06
78          Other           0.00
84          Other           0.00
86           Wine           1.83
97           Wine           0.00
99           Wine           0.00

###Q 7.6
find average consumption of wine per person greater than 2 in Alcohol_Dataset.

In [ ]:
#calculate average
wine_df = df[df['Beverage Types'] == 'Wine']
wine_df = wine_df[wine_df['Display Value'] > 2]

# Calculate the average consumption of wine per person
average_wine_consumption = wine_df['Display Value'].mean()

# Display the result
print("\nAverage consumption of wine per person greater than 2:")
print(average_wine_consumption)

Average consumption of wine per person greater than 2:
5.006666666666667

###Q 7.7
filter all records where the average consumption of beverages per person from .5 to 2.50 in Alcohol_Dataset

In [ ]:
#filter data
average_consumption_per_person = df.groupby(['Year', 'WHO region','Country'])['Display Value'].mean().reset_index()

# Filter rows based on the condition (average consumption of beverages per person from 0.5 to 2.5)
filtered_consumption = average_consumption_per_person[(average_consumption_per_person['Display Value'] >= 0.5) & (average_consumption_per_person['Display Value'] <= 2.5)]

# Display the filtered DataFrame
print("Filtered DataFrame:")
print(filtered_consumption)

Filtered DataFrame:
    Year             WHO region  \
1   1984                 Africa
5   1984               Americas
7   1984  Eastern Mediterranean
11  1984                 Europe
21  1985                 Africa
23  1985                 Africa
24  1985                 Africa
26  1985               Americas
33  1985                 Europe
38  1986                 Africa
41  1986               Americas
42  1986               Americas
43  1986               Americas
46  1986               Americas
47  1986  Eastern Mediterranean
52  1986                 Europe
53  1986                 Europe
67  1987               Americas
68  1987               Americas
70  1987               Americas
76  1987                 Europe
78  1987                 Europe
81  1989                 Africa
83  1989                 Africa
86  1989               Americas
88  1989               Americas
97  1989                 Europe

                                              Country  Display Value
1                                               Kenya           1.08
5                                         El Salvador           1.81
7                                             Bahrain           2.22
11                                             Norway           1.62
21                                       Cte d'Ivoire           1.62
23                                             Malawi           0.84
24                                               Mali           0.57
26                              Saint Kitts and Nevis           2.24
33  United Kingdom of Great Britain and Northern I...           1.36
38                                         Madagascar           1.02
41                                Antigua and Barbuda           1.55
42                                            Bahamas           1.83
43                   Bolivia (Plurinational State of)           2.06
46                                            Uruguay           0.50
47                                            Lebanon           0.70
52                                              Malta           1.49
53                                 Russian Federation           0.80
67                                          Nicaragua           0.70
68                              Saint Kitts and Nevis           1.98
70                                Trinidad and Tobago           2.26
76                                            Austria           1.90
78                                            Ireland           2.25
81                                          Mauritius           1.60
83                                         Seychelles           2.23
86                   Bolivia (Plurinational State of)           1.26
88                                          Guatemala           0.62
97                                            Finland           2.09

##Exercise 8
<table style="width:100%">
    <tr>
        <th>Dataframe index</th>
        <th>ord_no</th>
        <th>purch_amt</th>
        <th>ord_date</th>
        <th>customer_id</th>
        <th>salesman_id</th>
    </tr>
    <tr>    
        <td>0 </td>   
        <td>70001</td>   
        <td> 150.50</td>  
        <td>2012-10-05</td>         
        <td>3005</td>         
        <td>5002</td>
    </tr>
    <tr>    
        <td>1 </td>   
        <td>70009</td>   
        <td> 270.65</td>  
        <td>2012-09-10</td>         
        <td>3001</td>         
        <td>5005</td>
    </tr>
    <tr>    
        <td>2 </td>   
        <td>70002</td>   
        <td>  65.26</td>  
        <td>2012-10-05</td>         
        <td>3002</td>         
        <td>5001</td>
    </tr>
    <tr>    
        <td>3 </td>   
        <td>70004</td>   
        <td> 110.50</td>  
        <td>2012-08-17</td>         
        <td>3009</td>         
        <td>5003</td>
    </tr>
    <tr>    
        <td>4 </td>   
        <td>70007</td>   
        <td> 948.50</td>  
        <td>2012-09-10</td>         
        <td>3005</td>         
        <td>5002</td>
    </tr>
    <tr>    
        <td>5 </td>   
        <td>70005</td>   
        <td>2400.60</td>  
        <td>2012-07-27</td>         
        <td>3007</td>         
        <td>5001</td>
    </tr>
    <tr>    
        <td>6 </td>   
        <td>70008</td>   
        <td>5760.00</td>  
        <td>2012-09-10</td>         
        <td>3002</td>         
        <td>5001</td>
    </tr>
    <tr>    
        <td>7 </td>   
        <td>70010</td>   
        <td>1983.43</td>  
        <td>2012-10-10</td>         
        <td>3004</td>         
        <td>5006</td>
    </tr>
    <tr>    
        <td>8 </td>   
        <td>70003</td>   
        <td>2480.40</td>  
        <td>2012-10-10</td>         
        <td>3009</td>         
        <td>5003</td>
    </tr>
    <tr>    
        <td>9 </td>   
        <td>70012</td>   
        <td> 250.45</td>  
        <td>2012-06-27</td>         
        <td>3008</td>         
        <td>5002</td>
    </tr>
    <tr>    
        <td>10</td>   
        <td>70011</td>   
        <td>  75.29</td>  
        <td>2012-08-17</td>         
        <td>3003</td>         
        <td>5007</td>
    </tr>
    <tr>    
        <td>11</td>   
        <td>70013</td>   
        <td>3045.60</td>  
        <td>2012-04-25</td>         
        <td>3002</td>         
        <td>5001</td>
    </tr>
</table>

In [ ]:
#import pandas libraries and name it to be pd.

In [ ]:
#create dataframe


#display original dataframe

###Q 8.1
Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).

In [ ]:
#group by customer_id and find max, min, mean

###Q 8.2
split a dataset to group by two columns and count by each row.

In [ ]:
#group by salesman_id and custimer_id, and count

###Q 8.3
split the following dataframe into groups, group by month and year based on order date and find the total purchase amount year wise, month wise.

In [ ]:
#group by date and time and find sum

##Exercise 9
Given data
```
    ord_no   purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN
```

In [ ]:
#import pandas and numpy libraries and name it to be pd and np, respectively.

In [ ]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

#create dataframe


#display original dataframe

###Q 9.1
detect missing values of a given DataFrame. Display True or False.

In [ ]:
#check nan value and display the result

###Q 9.2
 identify the column(s) of a given DataFrame which have at least one missing value.

In [ ]:
#check column that have least one missing value and display the result

###Q 9.3
count the number of missing values in each column of a given DataFrame.

In [ ]:
#count number of missing values in each column and display the result

###Q 9.4
replace the missing values in a given DataFrame which do not have any valuable information.

In [ ]:
#replace nan by "?"


#display result

###Q 9.5
drop the rows where at least one element is missing in a given DataFrame.

In [ ]:
#drop rows that have nan value


#display result

###Q 9.6
drop the columns where at least one element is missing in a given DataFrame.

In [ ]:
#drop columns that have nan value


#display result

##Exercise 10
Create a dataframe of ten rows, four columns with random values. Convert some values to nan values. Write a Pandas program which will highlight the nan values.

Given data

```
np.random.seed(24)
df = pd.DataFrame({'A': np.linspace(1, 10, 10)})
df = pd.concat([df, pd.DataFrame(np.random.randn(10, 4), columns=list('BCDE'))], axis=1)
df.iloc[0, 2] = np.nan
df.iloc[3, 3] = np.nan
df.iloc[4, 1] = np.nan
df.iloc[9, 4] = np.nan
```

In [ ]:
#import pandas and numpy libraries and name it to be pd and np, respectively.

In [ ]:
#create dataframe


#display original dataframe

In [ ]:
#define function for fill color


#call function and display result

##Question 1
You and your spouse decided to let the internet name your next child. You’ve asked the great people of the web to submit their favorite names, and you’ve compiled their submissions into a Series called "babynames".

Voting result from internet
```
babynames =
    { 'Jathonathon', 'Zeltron', 'Ruger', 'Phreddy', 'Ruger', 'Chad', 'Chad',
    'Ruger', 'Ryan', 'Ruger', 'Chad', 'Ryan', 'Phreddy', 'Phreddy', 'Phreddy',
    'Mister', 'Zeltron', 'Ryan', 'Ruger', 'Ruger', 'Jathonathon',
    'Jathonathon', 'Ruger', 'Chad', 'Zeltron' }
```
Determine how many people voted for the names ‘Chad’, ‘Ruger’, and ‘Zeltron’.

##Question 2
Create, two Series bees and knees. The bees series contain "True, True, False, np.nan, True, False, True, np.nan" respectively and, the knees series contain [5,2,9,1,3,10,5,6] and index is [7,0,2,6,3,5,1,4].
<br>
<br>
If the i<sup>th</sup> value of bees is NaN, double the i<sup>th</sup> value inside knees.
<br>
Expected output:

```
bees
# 0     True
# 1     True
# 2    False
# 3      NaN
# 4     True
# 5    False
# 6     True
# 7      NaN

knees
# 7     5
# 0     2
# 2     9
# 6     1  <-- double this
# 3     3
# 5    10
# 1     5
# 4     6  <-- double this
```


<i>Hint: to_numpy</i>

##Question 3
You have a DataFrame called schedules that represents the daily schedule of each student in a school. For example, If Ryan attends four classes - math, english, history, and chemistry, your schedules DataFrame will have four rows for Ryan in the order he attends each class.


Given data
```
generator = np.random.default_rng(seed=1234)
classes = ['english', 'math', 'history', 'chemistry', 'gym', 'civics', 'writing', 'engineering']

schedules = pd.DataFrame({
    'student_id':np.repeat(np.arange(100), 4),
    'class':generator.choice(classes, size=400, replace=True)
}).drop_duplicates()
schedules['grade'] = generator.integers(101, size=schedules.shape[0])

print(schedules)
```

You have this theory that the sequence of class-to-class transitions affects students' grades. For instance, you suspect Ryan would do better in his Chemistry class if it immediately followed his Math class instead of his History class.
<br>
<br>
Determine the average and median Chemistry grade for groups of students based on the class they have immediately prior to Chemistry. Also report how many students fall into each group.

##Question 4
You own a gym 💪🏾 for pregnant women 🤰🏾 called “OB-GYM” and you recently opened a second location. You’d like to analyze its performance, but your reporting software has given you the sales data in an awkward format.

Given data

```
generator = np.random.default_rng(314)

sales = pd.DataFrame({
    'date':pd.date_range(start = '2020-01-01', periods=5).repeat(2),
    'store_id':np.tile([1,2], 5),
    'sales1':np.round(generator.normal(loc=750, scale=20, size=10), 2),
    'sales2':np.round(generator.normal(loc=650, scale=40, size=10), 2),
    'members':generator.integers(low=20, high=25, size=10)
})
sales.loc[sales.store_id == 2, 'sales1'] = np.nan
sales.loc[sales.store_id == 1, 'sales2'] = np.nan

print(sales)
```

The result after generate the data.
```
#         date  store_id  sales1  sales2  members
# 0 2020-01-01         1  737.54     NaN       22
# 1 2020-01-01         2     NaN  629.00       20
# 2 2020-01-02         1  750.75     NaN       23
# 3 2020-01-02         2     NaN  699.01       22
# 4 2020-01-03         1  750.60     NaN       20
# 5 2020-01-03         2     NaN  640.20       24
# 6 2020-01-04         1  752.65     NaN       21
# 7 2020-01-04         2     NaN  695.64       22
# 8 2020-01-05         1  747.02     NaN       20
# 9 2020-01-05         2     NaN  632.40       22
```

Reshape it into a DataFrame like this


```
#               sales_1  sales_2  members_1  members_2
# date
# 2020-01-01    737.54    629.00         22         20
# 2020-01-02    750.75    699.01         23         22
# 2020-01-03    750.60    640.20         20         24
# 2020-01-04    752.65    695.64         21         22
# 2020-01-05    747.02    632.40         20         22
```

##Question 5
You polled five heterosexual couples on their hobbies.

Given data
```
couples = pd.DataFrame({
    'man': [
        ['fishing', 'biking', 'reading'],
        ['hunting', 'mudding', 'fishing'],
        ['reading', 'movies', 'running'],
        ['running', 'reading', 'biking', 'mudding'],
        ['movies', 'reading', 'yodeling']
    ],
    'woman': [
        ['biking', 'reading', 'movies'],
        ['fishing', 'drinking'],
        ['knitting', 'reading'],
        ['running', 'biking', 'fishing', 'movies'],
        ['movies']
    ]
})

print(couples)
```

For each couple, determine what hobbies each man has that his wife doesn’t and what hobbies each woman has that her husband doesn’t.